In [1]:
%load_ext sql
%sql mysql+mysqlconnector://blackbasil:Naveen%402193@localhost/

In [2]:
%%sql
use de_project;

 * mysql+mysqlconnector://blackbasil:***@localhost/
0 rows affected.

[]

In [3]:
%%sql
CREATE TABLE CustomerDetails (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    email VARCHAR(100),
    phone_number VARCHAR(15),
    city VARCHAR(100)
);
INSERT INTO CustomerDetails (id, customer_name, email, phone_number, city) VALUES
(1, 'Alice Johnson', 'alice.johnson@example.com', '9876543210', 'Chennai'),
(2, 'Bob Smith', 'bob.smith@example.com', '9123456789', 'Bangalore'),
(3, 'Charlie Davis', 'charlie.davis@example.com', NULL, 'Delhi'),
(4, 'Diana Evans', 'diana.evans@example.com', '9090909090', 'Mumbai'),
(5, 'Ethan Moore', 'ethan.moore@example.com', '9000012345', 'Hyderabad');

 * mysql+mysqlconnector://blackbasil:***@localhost/
0 rows affected.
5 rows affected.

[]

In [29]:
%%sql

select * from CustomerData;

 * mysql+mysqlconnector://blackbasil:***@localhost/
5 rows affected.

[(1, 'Alice Johnson', 'alice.johnson@example.com', '9876543210', '123 Main Street, Chennai', Decimal('1500.00')),
 (2, 'Bob Smith', None, '9123456789', '45 Park Avenue, Bangalore', None),
 (3, 'Charlie Davis', 'charlie.davis@example.com', None, '78 MG Road, Delhi', Decimal('499.99')),
 (4, 'Diana Evans', None, None, '21 Green Street, Mumbai', Decimal('10250.50')),
 (5, 'Ethan Moore', 'ethan.moore@example.com', '9000012345', None, Decimal('875.00'))]

In [28]:
%%sql
update CustomerData set amount=NULL where id=2;

 * mysql+mysqlconnector://blackbasil:***@localhost/
1 rows affected.

[]

In [18]:
%%sql
select count(*) from CustomerData where phone_number is not null

 * mysql+mysqlconnector://blackbasil:***@localhost/
1 rows affected.

[(3,)]

In [27]:
%%sql

select 
    id,
    customer_name,
    email,
    phone_number,
    address
from
    CustomerData
where
    email is null
    and phone_number is null

 * mysql+mysqlconnector://blackbasil:***@localhost/
1 rows affected.

[(4, 'Diana Evans', None, None, '21 Green Street, Mumbai')]

In [32]:
%%sql
select  customer_name, amount, IFNULL(amount,'0.00')
from CustomerData

 * mysql+mysqlconnector://blackbasil:***@localhost/
5 rows affected.

[('Alice Johnson', Decimal('1500.00'), '1500.00'),
 ('Bob Smith', None, '0.00'),
 ('Charlie Davis', Decimal('499.99'), '499.99'),
 ('Diana Evans', Decimal('10250.50'), '10250.50'),
 ('Ethan Moore', Decimal('875.00'), '875.00')]

In [31]:
%%sql
select coalesce (NULL,NULL,NULL,'0.00',NULL,'11')

 * mysql+mysqlconnector://blackbasil:***@localhost/
1 rows affected.

[('0.00',)]